```sh
$ make deploy
npx --no cdktf deploy
learn-cdktf-docker  Initializing the backend...
learn-cdktf-docker
                    Successfully configured the backend "local"! Terraform will automatically
                    use this backend unless the backend configuration changes.
learn-cdktf-docker  Initializing provider plugins...
learn-cdktf-docker  - Finding kreuzwerker/docker versions matching "3.0.2"...
learn-cdktf-docker  - Installing kreuzwerker/docker v3.0.2...
learn-cdktf-docker  - Installed kreuzwerker/docker v3.0.2 (self-signed, key ID BD080C4571C6104C)

                    Partner and community providers are signed by their developers.
                    If you'd like to know more about provider signing, you can read about it here:
                    https://www.terraform.io/docs/cli/plugins/signing.html

                    Terraform has created a lock file .terraform.lock.hcl to record the provider
                    selections it made above. Include this file in your version control repository
                    so that Terraform can guarantee to make the same selections by default when
                    you run "terraform init" in the future.
learn-cdktf-docker  Terraform has been successfully initialized!

                    You may now begin working with Terraform. Try running "terraform plan" to see
                    any changes that are required for your infrastructure. All Terraform commands
                    should now work.

                    If you ever set or change modules or backend configuration for Terraform,
                    rerun this command to reinitialize your working directory. If you forget, other
                    commands will detect it and remind you to do so if necessary.
learn-cdktf-docker  - Fetching kreuzwerker/docker 3.0.2 for linux_amd64...
learn-cdktf-docker  - Retrieved kreuzwerker/docker 3.0.2 for linux_amd64 (self-signed, key ID BD080C4571C6104C)
                    - Obtained kreuzwerker/docker checksums for linux_amd64; Additional checksums for this platform are now tracked in the lock file
learn-cdktf-docker  Success! Terraform has updated the lock file.

                    Review the changes in .terraform.lock.hcl and then commit to your
                    version control system to retain the new checksums.
learn-cdktf-docker  Terraform used the selected providers to generate the following execution plan.
                    Resource actions are indicated with the following symbols:
                      + create

                    Terraform will perform the following actions:
learn-cdktf-docker    # docker_container.nginxContainer (nginxContainer) will be created
                      + resource "docker_container" "nginxContainer" {
                          + attach                                      = false
                          + bridge                                      = (known after apply)
                          + command                                     = (known after apply)
                          + container_logs                              = (known after apply)
                          + container_read_refresh_timeout_milliseconds = 15000
                          + entrypoint                                  = (known after apply)
                          + env                                         = (known after apply)
                          + exit_code                                   = (known after apply)
                          + hostname                                    = (known after apply)
                          + id                                          = (known after apply)
learn-cdktf-docker  + image                                       = "nginx:latest"
                          + init                                        = (known after apply)
                          + ipc_mode                                    = (known after apply)
                          + log_driver                                  = (known after apply)
                          + logs                                        = false
                          + must_run                                    = true
                          + name                                        = "tutorial"
                          + network_data                                = (known after apply)
                          + read_only                                   = false
                          + remove_volumes                              = true
                          + restart                                     = "no"
                          + rm                                          = false
                          + runtime                                     = (known after apply)
learn-cdktf-docker  + security_opts                               = (known after apply)
                          + shm_size                                    = (known after apply)
                          + start                                       = true
                          + stdin_open                                  = false
                          + stop_signal                                 = (known after apply)
                          + stop_timeout                                = (known after apply)
                          + tty                                         = false
                          + wait                                        = false
                          + wait_timeout                                = 60

                          + ports {
                              + external = 8080
                              + internal = 80
                              + ip       = "0.0.0.0"
                              + protocol = "tcp"
                            }
                        }

                      # docker_image.nginxImage (nginxImage) will be created
learn-cdktf-docker    + resource "docker_image" "nginxImage" {
                          + id           = (known after apply)
                          + image_id     = (known after apply)
                          + keep_locally = true
                          + name         = "nginx:latest"
                          + repo_digest  = (known after apply)
                        }

                    Plan: 2 to add, 0 to change, 0 to destroy.

                    Do you want to perform these actions?
                      Terraform will perform the actions described above.
                      Only 'yes' will be accepted to approve.
learn-cdktf-docker  Enter a value: no

                    Apply cancelled.

No outputs found.
```